{"meta":{"title":"0년차 개발자의 블로그","subtitle":"happy hacking중!","description":"","author":"hackertaco","url":"https://hackertaco.github.io","root":"/"},"pages":[],"posts":[{"title":"개발일기","slug":"개발일기","date":"2020-12-02T14:34:28.000Z","updated":"2020-12-10T14:41:12.999Z","comments":true,"path":"2020/12/02/개발일기/","link":"","permalink":"https://hackertaco.github.io/2020/12/02/%EA%B0%9C%EB%B0%9C%EC%9D%BC%EA%B8%B0/","excerpt":"","text":"01. 비전공자 개발 뉴비로 살아간다는 것1234어릴때부터 기술 가정 과목 중에 기술을 겁나 싫어했다. 나는 정말 오만거에 관심을 두는 성격인데도, 이상하게 성격조사나 적성 검사를 하면 기술에는 거의 빵점이 나왔다.그래서 개발은 인생에서 절대 나와 관련이 없을 것이라고 생각했다.그런데 어쩌다가.. 02. 개발은 도구라고 생각한다.1234567891011어쩌다가..서비스 기획을 해보고싶어서 회사를 다니다가, 개발에 관심이 생겼다.기획은 내가 상상한 것을 구체적으로 설명할 수 있는 직무다.다만, 문제는 기획은 어디까지나 &#39;현실 속에서&#39; 상상한 것을 구체화해야 한다는 것이었다.금전, 지금 당장의 고객, 개발자와의 소통 등 현실의 벽과 마주한 그 수많은 날들.조금은 무력감을 느끼던 그 때, 개발을 시작했다.내가 상상해오던 것을 만들 수 있는 세상은 너무도 멋진 세상.상상을 실제로 구현할 수 있는 것은 너무도 멋진 일.내가 할 수 있는 것과 잘 하는 일이 합쳐져있다고 생각했다.내가 서비스 기획에서 느낀 한계를 개발자로서 재밌게 풀어나갈 수 있을 것 같았다. 03. 하지만 개발을 잘하려면 개발이 목적이 되어야 하는 세상12345678910그러나 개발을 잘하는 거슨 너무도 어려운 일이었으니, 좋아해야 개발을 할 수 있다.매일 마주하는 수많은 버그들과 똥같은 코드들을 보면서아 이걸 고쳐내보자 하는 도전과 용기가 매번 필요한 것이 어려웠다.그래서,어렵고 빠르게 변하고 다양한 층위의 지식이 섞인 이 곳의 지식은,흥미가 필수 불가결한 요소.거기에 적성까지 붙는다면 정말 금상첨화지만,그런 복받은 사람이 세상에 얼마나 될까.우선 나는 복받지 못했다. 04. 그 속에서 나의 비전과 목표12345그럼에도, 개발을 해야하는 건,내가 만들어왔고 만들고싶은 수많은 재미난 것들이개발로 가능하다고 느끼고 있기 때문이다.아직은 많이 부족하지만,분명히 나아지고 있다는 것을 알고있다. 존버해야지 ㅠ 어쩌겠누","categories":[],"tags":[]},{"title":"vue3를 처음으로 맞이하는 0년차개발자(1)","slug":"my-new-post","date":"2020-10-19T14:27:31.000Z","updated":"2020-12-03T13:54:11.169Z","comments":true,"path":"2020/10/19/my-new-post/","link":"","permalink":"https://hackertaco.github.io/2020/10/19/my-new-post/","excerpt":"","text":"마크다운으로 처음 글도 써보고, 뷰3도 투두리스트 구현까지 해본 초보 개발(희망)자.뷰로 관리자페이지를 만드는 그 날까지..! 열싐히 기록해볼 것이다. 1. vue3 tutorial을 찾다10시간동안 10개의 앱 만들기너무 좋은 영상을 알게되었다. 지인이 알려주었는데.. 그는 천사일까?💦[youtube] (https://www.youtube.com/watch?v=e-E0UB-YDRk&amp;feature=youtu.be)이거 보면서 열심히 해볼것이다. 뷰2에 비해 새로 나온 vue3 composition api도 쓴단다(두근) 2. vue 개략한 줄 요약 : 뷰는 적응하기 쉬워! 프레임워크 안에서 놀면 된다.뷰를 말해보자면 웹 페이지를 만드는 것을 도와주는!(리액트랑 비교해보자면, 리액트는 상대적으로 라이브러리의 성격이 강해서 js를 좀 잘해야 한다.) 뷰를 실행하는 가장 쉬운 방법은 cdn 사용 를 html head tag 안에 넣어주면 된다. 그러면 ! 3. 잡다한 지식 조각 뷰 3부터는 data가 함수의 모양을 하고 있어야 한다. vetur는 뷰 글자 자동완성 내지는 템플릿 자동완성 해주는 아주 조은 익스텐션 vue devtool로 많은 걸 할 수 있지. v-model은 data와 화면 둘다 묶는다. 4. directives 뷰에는 directives라는 지시어가 있다. 이는 template과 script를 서로 연결해주는 어떤것으로 우선 이해했다. data, computed, methods 등을 모두 연결할 수 있다. 그 중 한 예로 v-model은 input과 같이 html태그 중 어떤 것을 에력하는 태그인 경우에, vue script tag 내의 데이터와 입력 값을 서로 연결해준다. v-once는 렌더링이 딱 한번 되는 것. 5. vue router 라우터가 있어야 하는 이유는 vue가 SPA 즉, single page application 인 것과 관계가 있다. SPA는 최초 한번만 전체 페이지를 로딩한 후 데이터만 변경해서 사용하는 어플리케이션이다. 이 SPA는 html, js와 같은 파일을 렌더링할 때 클라이언트 사이드 렌더링이라는 방식을 이용한다. 기본적으로 페이지가 따로 없다 (single page니까!) 모든 페이지는 단순히 HTML5 History에 의해 렌더링 될 뿐이다. 그래서 언제 새 데이터를 불러와야 할지를 스스로 정해야 한다. 즉 사용자의 행동에 따라 어떤 데이터가 불려올지가 정해진다. SPA라고 할지라도 한 종류의 화면만 있는 것은 아니다 ! 화면에 따라 다른 주소를 가진다. 주소에 따라 여러 뷰를 렌더링하는 것을 라우팅이라고 하고, vue 자체에는 이 기능이 내장돼있지 않다. 대신 vue-router가 있다. 그러니까, 일단 vue-router를 add 해준다. 라우터를 통해 변할 페이지의 위치에서, 를 써줘 링크를 넣을 곳에 router-link 태그 main.js에 난 라우터를 쓸 것이라고 이야기해줘야한다. createApp(App).use(router) 이렇게? default mode는 hash mode이다. SPA 환경에서 바뀐 부분만 렌더링해주어야 하기에 hash(#)를 써서 full URL을 시뮬레이트하기 때문. 만일 이 해쉬를 없애고 싶다면, 라우터의 히스토리모드를 사용할 수 있다.","categories":[],"tags":[{"name":"개발뉴비","slug":"개발뉴비","permalink":"https://hackertaco.github.io/tags/%EA%B0%9C%EB%B0%9C%EB%89%B4%EB%B9%84/"}]},{"title":"Hello World","slug":"hello-world","date":"2020-10-19T14:24:52.190Z","updated":"2020-10-19T14:24:52.191Z","comments":true,"path":"2020/10/19/hello-world/","link":"","permalink":"https://hackertaco.github.io/2020/10/19/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[{"name":"개발뉴비","slug":"개발뉴비","permalink":"https://hackertaco.github.io/tags/%EA%B0%9C%EB%B0%9C%EB%89%B4%EB%B9%84/"}]}